; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	spectrograph0 - mode
	spectrograph4 - mode
	image3 - mode
	infrared2 - mode
	image1 - mode
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation0 - direction
	Star5 - direction
	GroundStation3 - direction
	Star14 - direction
	Star1 - direction
	GroundStation12 - direction
	Star10 - direction
	GroundStation13 - direction
	Star2 - direction
	Star4 - direction
	Star6 - direction
	Star9 - direction
	GroundStation11 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 image3)
	(supports instrument3 spectrograph4)
	(supports instrument3 image1)
	(calibration_target instrument3 Star14)
	(supports instrument4 image3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 GroundStation12)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared2)
	(supports instrument5 image1)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation13)
	(calibration_target instrument5 Star10)
	(supports instrument6 image1)
	(supports instrument6 spectrograph4)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument7 image3)
	(supports instrument7 image1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star9)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared2)
	(calibration_target instrument8 Star6)
	(supports instrument9 spectrograph0)
	(supports instrument9 infrared2)
	(calibration_target instrument9 GroundStation11)
	(calibration_target instrument9 Star9)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon17)
)
(:goal (and
	(have_image Star15 spectrograph0)
	(have_image Star16 image3)
	(have_image Phenomenon17 infrared2)
	(have_image Planet18 image1)
	(have_image Phenomenon19 image1)
))

)

; plan
1. (turn_to satellite2 star9 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star9)
   goals met: 0 of 5
2. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 5
3. (calibrate satellite2 instrument7 star9)
   added: (calibrated instrument7)
   goals met: 0 of 5
4. (turn_to satellite2 planet18 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 planet18)
   goals met: 0 of 5
5. (take_image satellite2 planet18 instrument7 image1)
   added: (have_image planet18 image1)
   goals met: 1 of 5
6. (turn_to satellite2 phenomenon19 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 phenomenon19)
   goals met: 1 of 5
7. (take_image satellite2 phenomenon19 instrument7 image1)
   added: (have_image phenomenon19 image1)
   goals met: 2 of 5
8. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 2 of 5
9. (calibrate satellite1 instrument5 star9)
   added: (calibrated instrument5)
   goals met: 2 of 5
10. (turn_to satellite1 phenomenon17 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 5
11. (take_image satellite1 phenomenon17 instrument5 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 3 of 5
12. (turn_to satellite2 star15 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 star15)
   goals met: 3 of 5
13. (take_image satellite2 star15 instrument7 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 4 of 5
14. (turn_to satellite2 star16 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star16)
   goals met: 4 of 5
15. (take_image satellite2 star16 instrument7 image3)
   added: (have_image star16 image3)
   goals met: 5 of 5
